tap "koekeishiya/formulae"
tap "oven-sh/bun"
tap "disrupted/neovim-nightly"
brew "alejandra"
brew "direnv"
brew "node"
brew "docker-compose-langserver"
brew "dockerfile-language-server"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "go", postinstall: "/opt/homebrew/bin/go telemetry off"
brew "gofumpt"
brew "openjdk", postinstall: "mkdir -p ~/Library/Java/JavaVirtualMachines && ln -sfn /opt/homebrew/opt/openjdk/libexec/openjdk.jdk ~/Library/Java/JavaVirtualMachines/openjdk.jdk"
brew "google-java-format"
brew "gopls"
brew "helix"
brew "imagemagick"
brew "python@3.14"
brew "jdtls"
brew "lazydocker"
brew "lazygit"
brew "lua-language-server"
brew "prettier"
brew "pyright"
brew "python@3.12"
brew "python@3.13"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "rust-analyzer"
brew "starship"
brew "stow"
brew "stylua"
brew "superhtml"
brew "swift-format"
brew "taplo"
brew "tombi"
brew "tree"
brew "typescript"
brew "typescript-language-server"
brew "uv"
brew "vscode-langservers-extracted"
brew "yaml-language-server"
brew "yamlfmt"
brew "zig"
brew "zls"
brew "zoxide"
brew "koekeishiya/formulae/skhd"
brew "oven-sh/bun/bun"
cask "font-iosevka-nerd-font", greedy: true
cask "font-iosevka-ss03", greedy: true
cask "helium-browser", greedy: true
cask "kitty", greedy: true
cask "neovim-nightly", greedy: true
cask "orbstack", greedy: true
