system "defaults write -g ApplePressAndHoldEnabled -bool false"
system "defaults write -g InitialKeyRepeat -int 10"
system "defaults write -g KeyRepeat -int 1"
system "defaults write com.apple.dock persistent-apps -array"
tap "disrupted/neovim-nightly"
tap "oven-sh/bun"
brew "fd"
brew "fzf"
brew "gh"
brew "go", postinstall: "/opt/homebrew/bin/go telemetry off"
brew "lazydocker"
brew "lazygit"
brew "python"
brew "node"
brew "ripgrep"
brew "rust"
brew "stow"
brew "tree"
brew "uv"
brew "zig"
brew "zoxide"
brew "oven-sh/bun/bun"
cask "font-iosevka-nerd-font", greedy: true
cask "font-iosevka-ss03", greedy: true
cask "helium-browser", greedy: true
cask "kitty", greedy: true
cask "neovim-nightly", greedy: true
cask "orbstack", greedy: true
cask "raycast", greedy: true
